/**
 * \file modbus/devices/elhart/alphax_module_registers.h
 * \brief Адреса регистров Modbus модулей Alpha-X
 * \ingroup modbus_devices_elhart_alphax_parameter
 */

#pragma once

#include <cstdint>

namespace modbus::devices::elhart::alphax_parameter
{
  /**
   * \brief Номера регистров модуля Alpha-X
   * \ingroup modbus_devices_elhart_alphax_parameter
   */
  struct REGISTERS
  {
    enum NUMBER : uint16_t
    {
      // ОПЕРАТИВНЫЕ ПАРАМЕТРЫ

      //! Состояние дискретных входов (битовая маска)
      DINPUTS            = 0,
      //! Состояние дискретных выходов (битовая маска)
      DOUTPUTS           = 1,
      //! Наличие физического сигнала на дискретных входах (битовая маска)
      DINPUTS_SIGNAL     = 2,
      //! Фактическое состояние дискретных выходов (битовая маска)
      DOUTPUTS_SIGNAL    = 3,
      //! Показания в формате INT16 аналогового входа №1
      AINPUT1_INT        = 4,
      //! Показания в формате INT16 аналогового входа №2
      AINPUT2_INT        = 5,
      //! Показания в формате INT16 аналогового входа №3
      AINPUT3_INT        = 6,
      //! Показания в формате INT16 аналогового входа №4
      AINPUT4_INT        = 7,
      //! Показания в формате INT16 аналогового входа №5
      AINPUT5_INT        = 8,
      //! Показания в формате INT16 аналогового входа №6
      AINPUT6_INT        = 9,
      //! Показания в формате INT16 аналогового входа №7
      AINPUT7_INT        = 10,
      //! Показания в формате INT16 аналогового входа №8
      AINPUT8_INT        = 11,
      //! Значение в формате INT16 аналогового выхода №1
      AOUTPUT1_INT       = 12,
      //! Значение в формате INT16 аналогового выхода №2
      AOUTPUT2_INT       = 13,
      //! Значение в формате INT16 аналогового выхода №3
      AOUTPUT3_INT       = 14,
      //! Значение в формате INT16 аналогового выхода №4
      AOUTPUT4_INT       = 15,
      //! Значение в формате Float аналогового входа №1, младшее слово
      AINPUT1_FLOAT_LSR  = 16,
      //! Значение в формате Float аналогового входа №1, старшее слово
      AINPUT1_FLOAT_MSR  = 17,
      //! Значение в формате Float аналогового входа №2, младшее слово
      AINPUT2_FLOAT_LSR  = 18,
      //! Значение в формате Float аналогового входа №2, старшее слово
      AINPUT2_FLOAT_MSR  = 19,
      //! Значение в формате Float аналогового входа №3, младшее слово
      AINPUT3_FLOAT_LSR  = 20,
      //! Значение в формате Float аналогового входа №3, старшее слово
      AINPUT3_FLOAT_MSR  = 21,
      //! Значение в формате Float аналогового входа №4, младшее слово
      AINPUT4_FLOAT_LSR  = 22,
      //! Значение в формате Float аналогового входа №4, старшее слово
      AINPUT4_FLOAT_MSR  = 23,
      //! Значение в формате Float аналогового входа №5, младшее слово
      AINPUT5_FLOAT_LSR  = 24,
      //! Значение в формате Float аналогового входа №5, старшее слово
      AINPUT5_FLOAT_MSR  = 25,
      //! Значение в формате Float аналогового входа №6, младшее слово
      AINPUT6_FLOAT_LSR  = 26,
      //! Значение в формате Float аналогового входа №6, старшее слово
      AINPUT6_FLOAT_MSR  = 27,
      //! Значение в формате Float аналогового входа №7, младшее слово
      AINPUT7_FLOAT_LSR  = 28,
      //! Значение в формате Float аналогового входа №7, старшее слово
      AINPUT7_FLOAT_MSR  = 29,
      //! Значение в формате Float аналогового входа №8, младшее слово
      AINPUT8_FLOAT_LSR  = 30,
      //! Значение в формате Float аналогового входа №8, старшее слово
      AINPUT8_FLOAT_MSR  = 31,
      //! Значение в формате Float аналогового выхода №1, младшее слово
      AOUTPUT1_FLOAT_LSR = 32,
      //! Значение в формате Float аналогового выхода №1, старшее слово
      AOUTPUT1_FLOAT_MSR = 33,
      //! Значение в формате Float аналогового выхода №2, младшее слово
      AOUTPUT2_FLOAT_LSR = 34,
      //! Значение в формате Float аналогового выхода №2, старшее слово
      AOUTPUT2_FLOAT_MSR = 35,
      //! Значение в формате Float аналогового выхода №3, младшее слово
      AOUTPUT3_FLOAT_LSR = 36,
      //! Значение в формате Float аналогового выхода №3, старшее слово
      AOUTPUT3_FLOAT_MSR = 37,
      //! Значение в формате Float аналогового выхода №4, младшее слово
      AOUTPUT4_FLOAT_LSR = 38,
      //! Значение в формате Float аналогового выхода №4, старшее слово
      AOUTPUT4_FLOAT_MSR = 39,
      //! Показания физической величины сигнала аналогового входа №1
      AINPUT1_PV         = 40,
      //! Показания физической величины сигнала аналогового входа №2
      AINPUT2_PV         = 41,
      //! Показания физической величины сигнала аналогового входа №3
      AINPUT3_PV         = 42,
      //! Показания физической величины сигнала аналогового входа №4
      AINPUT4_PV         = 43,
      //! Показания физической величины сигнала аналогового входа №5
      AINPUT5_PV         = 44,
      //! Показания физической величины сигнала аналогового входа №6
      AINPUT6_PV         = 45,
      //! Показания физической величины сигнала аналогового входа №7
      AINPUT7_PV         = 46,
      //! Показания физической величины сигнала аналогового входа №8
      AINPUT8_PV         = 47,
      //! Показания физической величины сигнала аналогового выхода №1
      AOUTPUT1_PV        = 48,
      //! Показания физической величины сигнала аналогового выхода №2
      AOUTPUT2_PV        = 49,
      //! Показания физической величины сигнала аналогового выхода №3
      AOUTPUT3_PV        = 50,
      //! Показания физической величины сигнала аналогового выхода №4
      AOUTPUT4_PV        = 51,
      //! Статус работы аналогового входа №1
      AINPUT1_STATUS     = 52,
      //! Статус работы аналогового входа №2
      AINPUT2_STATUS     = 53,
      //! Статус работы аналогового входа №3
      AINPUT3_STATUS     = 54,
      //! Статус работы аналогового входа №4
      AINPUT4_STATUS     = 55,
      //! Статус работы аналогового входа №5
      AINPUT5_STATUS     = 56,
      //! Статус работы аналогового входа №6
      AINPUT6_STATUS     = 57,
      //! Статус работы аналогового входа №7
      AINPUT7_STATUS     = 58,
      //! Статус работы аналогового входа №8
      AINPUT8_STATUS     = 59,
      //! Статус работы аналогового выхода №1
      AOUTPUT1_STATUS    = 60,
      //! Статус работы аналогового выхода №2
      AOUTPUT2_STATUS    = 61,
      //! Статус работы аналогового выхода №3
      AOUTPUT3_STATUS    = 62,
      //! Статус работы аналогового выхода №4
      AOUTPUT4_STATUS    = 63,
      //! Значение в формате INT16 температуры холодного спая
      JUNCTION_INT  = 64,
      //! Значение в формате Float температуры холодного спая, младшее слово
      JUNCTION_FLOAT_LSR = 65,
      //! Значение в формате Float температуры холодного спая, старшее слово
      JUNCTION_FLOAT_MSR = 66,

      // СЧЕТЧИКИ И ЧАСТОТОМЕРЫ

      COUNTER1_VALUE_LSR = 80, //!< Значение счетчика 32-bit №1, младшее слово
      COUNTER1_VALUE_MSR = 81, //!< Значение счетчика 32-bit №1, старшее слово
      COUNTER2_VALUE_LSR = 82, //!< Значение счетчика 32-bit №2, младшее слово
      COUNTER2_VALUE_MSR = 83, //!< Значение счетчика 32-bit №2, старшее слово
      COUNTER3_VALUE_LSR = 84, //!< Значение счетчика 32-bit №3, младшее слово
      COUNTER3_VALUE_MSR = 85, //!< Значение счетчика 32-bit №3, старшее слово
      COUNTER4_VALUE_LSR = 86, //!< Значение счетчика 32-bit №4, младшее слово
      COUNTER4_VALUE_MSR = 87, //!< Значение счетчика 32-bit №4, старшее слово

      COUNTER1_INPUT_SETUP = 88, //!< Настройки входов счетчика №1
      COUNTER2_INPUT_SETUP = 89, //!< Настройки входов счетчика №2
      COUNTER3_INPUT_SETUP = 90, //!< Настройки входов счетчика №3
      COUNTER4_INPUT_SETUP = 91, //!< Настройки входов счетчика №4

      COUNTER1_CONTROL = 92, //!< Управление счетчиком №1
      COUNTER2_CONTROL = 93, //!< Управление счетчиком №2
      COUNTER3_CONTROL = 94, //!< Управление счетчиком №3
      COUNTER4_CONTROL = 95, //!< Управление счетчиком №4
      
      FREQUENCY_METER_1 = 112, //!< Частотомер №1, Гц * 10
      FREQUENCY_METER_2 = 113, //!< Частотомер №2, Гц * 10
      FREQUENCY_METER_3 = 114, //!< Частотомер №3, Гц * 10
      FREQUENCY_METER_4 = 115, //!< Частотомер №4, Гц * 10

      //! Время определения частоты для частотомера №1, с
      FREQUENCY_PERIOD_1 = 116, 
      //! Время определения частоты для частотомера №2, с
      FREQUENCY_PERIOD_2 = 117,
      //! Время определения частоты для частотомера №3, с
      FREQUENCY_PERIOD_3 = 118,
      //! Время определения частоты для частотомера №4, с
      FREQUENCY_PERIOD_4 = 119,

      // ШИРОТНО-ИМПУЛЬСНАЯ МОДУЛЯЦИЯ (ШИМ)

      PWM_PERIOD_DO1  = 144, //!< Период ШИМ выхода DO1, x * 100 мс
      PWM_PERIOD_DO2  = 145, //!< Период ШИМ выхода DO2, x * 100 мс
      PWM_PERIOD_DO3  = 146, //!< Период ШИМ выхода DO3, x * 100 мс
      PWM_PERIOD_DO4  = 147, //!< Период ШИМ выхода DO4, x * 100 мс
      PWM_PERIOD_DO5  = 148, //!< Период ШИМ выхода DO5, x * 100 мс
      PWM_PERIOD_DO6  = 149, //!< Период ШИМ выхода DO6, x * 100 мс
      PWM_PERIOD_DO7  = 150, //!< Период ШИМ выхода DO7, x * 100 мс
      PWM_PERIOD_DO8  = 151, //!< Период ШИМ выхода DO8, x * 100 мс
      PWM_PERIOD_DO9  = 152, //!< Период ШИМ выхода DO9, x * 100 мс
      PWM_PERIOD_DO10 = 153, //!< Период ШИМ выхода DO10, x * 100 мс
      PWM_PERIOD_DO11 = 154, //!< Период ШИМ выхода DO11, x * 100 мс
      PWM_PERIOD_DO12 = 155, //!< Период ШИМ выхода DO12, x * 100 мс
      PWM_PERIOD_DO13 = 156, //!< Период ШИМ выхода DO13, x * 100 мс
      PWM_PERIOD_DO14 = 157, //!< Период ШИМ выхода DO14, x * 100 мс
      PWM_PERIOD_DO15 = 158, //!< Период ШИМ выхода DO15, x * 100 мс
      PWM_PERIOD_DO16 = 159, //!< Период ШИМ выхода DO16, x * 100 мс

      PWM_DUTY_CYCLE_DO1  = 160, //!< Скважность ШИМ выхода DO1, % * 100
      PWM_DUTY_CYCLE_DO2  = 161, //!< Скважность ШИМ выхода DO2, % * 100
      PWM_DUTY_CYCLE_DO3  = 162, //!< Скважность ШИМ выхода DO3, % * 100
      PWM_DUTY_CYCLE_DO4  = 163, //!< Скважность ШИМ выхода DO4, % * 100
      PWM_DUTY_CYCLE_DO5  = 164, //!< Скважность ШИМ выхода DO5, % * 100
      PWM_DUTY_CYCLE_DO6  = 165, //!< Скважность ШИМ выхода DO6, % * 100
      PWM_DUTY_CYCLE_DO7  = 166, //!< Скважность ШИМ выхода DO7, % * 100
      PWM_DUTY_CYCLE_DO8  = 167, //!< Скважность ШИМ выхода DO8, % * 100
      PWM_DUTY_CYCLE_DO9  = 168, //!< Скважность ШИМ выхода DO9, % * 100
      PWM_DUTY_CYCLE_DO10 = 169, //!< Скважность ШИМ выхода DO10, % * 100
      PWM_DUTY_CYCLE_DO11 = 170, //!< Скважность ШИМ выхода DO11, % * 100
      PWM_DUTY_CYCLE_DO12 = 171, //!< Скважность ШИМ выхода DO12, % * 100
      PWM_DUTY_CYCLE_DO13 = 172, //!< Скважность ШИМ выхода DO13, % * 100
      PWM_DUTY_CYCLE_DO14 = 173, //!< Скважность ШИМ выхода DO14, % * 100
      PWM_DUTY_CYCLE_DO15 = 174, //!< Скважность ШИМ выхода DO15, % * 100
      PWM_DUTY_CYCLE_DO16 = 175, //!< Скважность ШИМ выхода DO16, % * 100

      // НАСТРОЙКИ ДИСКРЕТНЫХ ВХОДОВ

      DINPUTS_NO_NC    = 192, //!< Логика работы входов НЗ/НО, битовая маска

      DINPUT_TON_DI1   = 193, //!< Задержка включения (TON) DI1, x * 500 мкс
      DINPUT_TON_DI2   = 194, //!< Задержка включения (TON) DI2, x * 500 мкс
      DINPUT_TON_DI3   = 195, //!< Задержка включения (TON) DI3, x * 500 мкс
      DINPUT_TON_DI4   = 196, //!< Задержка включения (TON) DI4, x * 500 мкс
      DINPUT_TON_DI5   = 197, //!< Задержка включения (TON) DI5, x * 500 мкс
      DINPUT_TON_DI6   = 198, //!< Задержка включения (TON) DI6, x * 500 мкс
      DINPUT_TON_DI7   = 199, //!< Задержка включения (TON) DI7, x * 500 мкс
      DINPUT_TON_DI8   = 200, //!< Задержка включения (TON) DI8, x * 500 мкс
      DINPUT_TON_DI9   = 201, //!< Задержка включения (TON) DI9, x * 500 мкс
      DINPUT_TON_DI10  = 202, //!< Задержка включения (TON) DI10, x * 500 мкс
      DINPUT_TON_DI11  = 203, //!< Задержка включения (TON) DI11, x * 500 мкс
      DINPUT_TON_DI12  = 204, //!< Задержка включения (TON) DI12, x * 500 мкс
      DINPUT_TON_DI13  = 205, //!< Задержка включения (TON) DI13, x * 500 мкс
      DINPUT_TON_DI14  = 206, //!< Задержка включения (TON) DI14, x * 500 мкс
      DINPUT_TON_DI15  = 207, //!< Задержка включения (TON) DI15, x * 500 мкс
      DINPUT_TON_DI16  = 208, //!< Задержка включения (TON) DI16, x * 500 мкс

      DINPUT_TOF_DI1   = 209, //!< Задержка выключения (TOF) DI1, x * 500 мкс
      DINPUT_TOF_DI2   = 210, //!< Задержка выключения (TOF) DI2, x * 500 мкс
      DINPUT_TOF_DI3   = 211, //!< Задержка выключения (TOF) DI3, x * 500 мкс
      DINPUT_TOF_DI4   = 212, //!< Задержка выключения (TOF) DI4, x * 500 мкс
      DINPUT_TOF_DI5   = 213, //!< Задержка выключения (TOF) DI5, x * 500 мкс
      DINPUT_TOF_DI6   = 214, //!< Задержка выключения (TOF) DI6, x * 500 мкс
      DINPUT_TOF_DI7   = 215, //!< Задержка выключения (TOF) DI7, x * 500 мкс
      DINPUT_TOF_DI8   = 216, //!< Задержка выключения (TOF) DI8, x * 500 мкс
      DINPUT_TOF_DI9   = 217, //!< Задержка выключения (TOF) DI9, x * 500 мкс
      DINPUT_TOF_DI10  = 218, //!< Задержка выключения (TOF) DI10, x * 500 мкс
      DINPUT_TOF_DI11  = 219, //!< Задержка выключения (TOF) DI11, x * 500 мкс
      DINPUT_TOF_DI12  = 220, //!< Задержка выключения (TOF) DI12, x * 500 мкс
      DINPUT_TOF_DI13  = 221, //!< Задержка выключения (TOF) DI13, x * 500 мкс
      DINPUT_TOF_DI14  = 222, //!< Задержка выключения (TOF) DI14, x * 500 мкс
      DINPUT_TOF_DI15  = 223, //!< Задержка выключения (TOF) DI15, x * 500 мкс
      DINPUT_TOF_DI16  = 224, //!< Задержка выключения (TOF) DI16, x * 500 мкс

      // НАСТРОЙКИ ДИСКРЕТНЫХ ВЫХОДОВ

      //! Безопасное состояние дискретных выходов, битовая маска
      DOUTPUTS_SAFE_STATE = 240,
      //! Задержка перехода выходов в безопасное состояние, x * с
      DOUTPUTS_SAFE_STATE_DELAY = 241,
      
      DOUTPUT_TON_DO1  = 242, //!< Задержка включения (TON) DO1, x * 1 с
      DOUTPUT_TON_DO2  = 243, //!< Задержка включения (TON) DO2, x * 1 с
      DOUTPUT_TON_DO3  = 244, //!< Задержка включения (TON) DO3, x * 1 с
      DOUTPUT_TON_DO4  = 245, //!< Задержка включения (TON) DO4, x * 1 с
      DOUTPUT_TON_DO5  = 246, //!< Задержка включения (TON) DO5, x * 1 с
      DOUTPUT_TON_DO6  = 247, //!< Задержка включения (TON) DO6, x * 1 с
      DOUTPUT_TON_DO7  = 248, //!< Задержка включения (TON) DO7, x * 1 с
      DOUTPUT_TON_DO8  = 249, //!< Задержка включения (TON) DO8, x * 1 с
      DOUTPUT_TON_DO9  = 250, //!< Задержка включения (TON) DO9, x * 1 с
      DOUTPUT_TON_DO10 = 251, //!< Задержка включения (TON) DO10, x * 1 с
      DOUTPUT_TON_DO11 = 252, //!< Задержка включения (TON) DO11, x * 1 с
      DOUTPUT_TON_DO12 = 253, //!< Задержка включения (TON) DO12, x * 1 с
      DOUTPUT_TON_DO13 = 254, //!< Задержка включения (TON) DO13, x * 1 с
      DOUTPUT_TON_DO14 = 255, //!< Задержка включения (TON) DO14, x * 1 с
      DOUTPUT_TON_DO15 = 256, //!< Задержка включения (TON) DO15, x * 1 с
      DOUTPUT_TON_DO16 = 257, //!< Задержка включения (TON) DO16, x * 1 с

      DOUTPUT_TOF_DO1  = 258, //!< Задержка выключения (TOF) DO1, x * 1 с
      DOUTPUT_TOF_DO2  = 259, //!< Задержка выключения (TOF) DO2, x * 1 с
      DOUTPUT_TOF_DO3  = 260, //!< Задержка выключения (TOF) DO3, x * 1 с
      DOUTPUT_TOF_DO4  = 261, //!< Задержка выключения (TOF) DO4, x * 1 с
      DOUTPUT_TOF_DO5  = 262, //!< Задержка выключения (TOF) DO5, x * 1 с
      DOUTPUT_TOF_DO6  = 263, //!< Задержка выключения (TOF) DO6, x * 1 с
      DOUTPUT_TOF_DO7  = 264, //!< Задержка выключения (TOF) DO7, x * 1 с
      DOUTPUT_TOF_DO8  = 265, //!< Задержка выключения (TOF) DO8, x * 1 с
      DOUTPUT_TOF_DO9  = 266, //!< Задержка выключения (TOF) DO9, x * 1 с
      DOUTPUT_TOF_DO10 = 267, //!< Задержка выключения (TOF) DO10, x * 1 с
      DOUTPUT_TOF_DO11 = 268, //!< Задержка выключения (TOF) DO11, x * 1 с
      DOUTPUT_TOF_DO12 = 269, //!< Задержка выключения (TOF) DO12, x * 1 с
      DOUTPUT_TOF_DO13 = 270, //!< Задержка выключения (TOF) DO13, x * 1 с
      DOUTPUT_TOF_DO14 = 271, //!< Задержка выключения (TOF) DO14, x * 1 с
      DOUTPUT_TOF_DO15 = 272, //!< Задержка выключения (TOF) DO15, x * 1 с
      DOUTPUT_TOF_DO16 = 273, //!< Задержка выключения (TOF) DO16, x * 1 с

      // НАСТРОЙКИ АНАЛОГОВЫХ ВХОДОВ

      AINPUT_TYPE_AI1  = 288, //!< Тип подключаемого датчика AI1
      AINPUT_TYPE_AI2  = 289, //!< Тип подключаемого датчика AI2
      AINPUT_TYPE_AI3  = 290, //!< Тип подключаемого датчика AI3
      AINPUT_TYPE_AI4  = 291, //!< Тип подключаемого датчика AI4
      AINPUT_TYPE_AI5  = 292, //!< Тип подключаемого датчика AI5
      AINPUT_TYPE_AI6  = 293, //!< Тип подключаемого датчика AI6
      AINPUT_TYPE_AI7  = 294, //!< Тип подключаемого датчика AI7
      AINPUT_TYPE_AI8  = 295, //!< Тип подключаемого датчика AI8

      AINPUT_FILTER_AI1 = 296, //!< Степень фильтрации сигнала AI1
      AINPUT_FILTER_AI2 = 297, //!< Степень фильтрации сигнала AI2
      AINPUT_FILTER_AI3 = 298, //!< Степень фильтрации сигнала AI3
      AINPUT_FILTER_AI4 = 299, //!< Степень фильтрации сигнала AI4
      AINPUT_FILTER_AI5 = 300, //!< Степень фильтрации сигнала AI5
      AINPUT_FILTER_AI6 = 301, //!< Степень фильтрации сигнала AI6
      AINPUT_FILTER_AI7 = 302, //!< Степень фильтрации сигнала AI7
      AINPUT_FILTER_AI8 = 303, //!< Степень фильтрации сигнала AI8

      //! Нижнее значение для приведения к пользовательской шкале, AI1
      AINPUT_NORMALIZE_LOW_AI1 = 304, 
      //! Нижнее значение для приведения к пользовательской шкале, AI2
      AINPUT_NORMALIZE_LOW_AI2 = 305, 
      //! Нижнее значение для приведения к пользовательской шкале, AI3
      AINPUT_NORMALIZE_LOW_AI3 = 306, 
      //! Нижнее значение для приведения к пользовательской шкале, AI4
      AINPUT_NORMALIZE_LOW_AI4 = 307, 
      //! Нижнее значение для приведения к пользовательской шкале, AI5
      AINPUT_NORMALIZE_LOW_AI5 = 308, 
      //! Нижнее значение для приведения к пользовательской шкале, AI6
      AINPUT_NORMALIZE_LOW_AI6 = 309, 
      //! Нижнее значение для приведения к пользовательской шкале, AI7
      AINPUT_NORMALIZE_LOW_AI7 = 310, 
      //! Нижнее значение для приведения к пользовательской шкале, AI8
      AINPUT_NORMALIZE_LOW_AI8 = 311, 

      //! Верхнее значение для приведения к пользовательской шкале, AI1
      AINPUT_NORMALIZE_HIGH_AI1 = 312,
      //! Верхнее значение для приведения к пользовательской шкале, AI2
      AINPUT_NORMALIZE_HIGH_AI2 = 313,
      //! Верхнее значение для приведения к пользовательской шкале, AI3
      AINPUT_NORMALIZE_HIGH_AI3 = 314,
      //! Верхнее значение для приведения к пользовательской шкале, AI4
      AINPUT_NORMALIZE_HIGH_AI4 = 315,
      //! Верхнее значение для приведения к пользовательской шкале, AI5
      AINPUT_NORMALIZE_HIGH_AI5 = 316,
      //! Верхнее значение для приведения к пользовательской шкале, AI6
      AINPUT_NORMALIZE_HIGH_AI6 = 317,
      //! Верхнее значение для приведения к пользовательской шкале, AI7
      AINPUT_NORMALIZE_HIGH_AI7 = 318,
      //! Верхнее значение для приведения к пользовательской шкале, AI8
      AINPUT_NORMALIZE_HIGH_AI8 = 319,

      //! Нижний уровень аналогового сигнала, AI1
      AINPUT_LEVEL_LOW_AI1 = 320,
      //! Нижний уровень аналогового сигнала, AI2
      AINPUT_LEVEL_LOW_AI2 = 321,
      //! Нижний уровень аналогового сигнала, AI3
      AINPUT_LEVEL_LOW_AI3 = 322,
      //! Нижний уровень аналогового сигнала, AI4
      AINPUT_LEVEL_LOW_AI4 = 323,
      //! Нижний уровень аналогового сигнала, AI5
      AINPUT_LEVEL_LOW_AI5 = 324,
      //! Нижний уровень аналогового сигнала, AI6
      AINPUT_LEVEL_LOW_AI6 = 325,
      //! Нижний уровень аналогового сигнала, AI7
      AINPUT_LEVEL_LOW_AI7 = 326,
      //! Нижний уровень аналогового сигнала, AI8
      AINPUT_LEVEL_LOW_AI8 = 327,

      //! Верхний уровень аналогового сигнала, AI1
      AINPUT_LEVEL_HIGH_AI1 = 328,
      //! Верхний уровень аналогового сигнала, AI2
      AINPUT_LEVEL_HIGH_AI2 = 329,
      //! Верхний уровень аналогового сигнала, AI3
      AINPUT_LEVEL_HIGH_AI3 = 330,
      //! Верхний уровень аналогового сигнала, AI4
      AINPUT_LEVEL_HIGH_AI4 = 331,
      //! Верхний уровень аналогового сигнала, AI5
      AINPUT_LEVEL_HIGH_AI5 = 332,
      //! Верхний уровень аналогового сигнала, AI6
      AINPUT_LEVEL_HIGH_AI6 = 333,
      //! Верхний уровень аналогового сигнала, AI7
      AINPUT_LEVEL_HIGH_AI7 = 334,
      //! Верхний уровень аналогового сигнала, AI8
      AINPUT_LEVEL_HIGH_AI8 = 335,

      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI1
      AINPUT_ALARM_LOW_AI1 = 336,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI2
      AINPUT_ALARM_LOW_AI2 = 337,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI3
      AINPUT_ALARM_LOW_AI3 = 338,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI4
      AINPUT_ALARM_LOW_AI4 = 339,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI5
      AINPUT_ALARM_LOW_AI5 = 340,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI6
      AINPUT_ALARM_LOW_AI6 = 341,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI7
      AINPUT_ALARM_LOW_AI7 = 342,
      //! Нижнее аварийное значение сигнала в пользовательском диапазоне, AI8
      AINPUT_ALARM_LOW_AI8 = 343,

      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI1
      AINPUT_ALARM_HIGH_AI1 = 344,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI2
      AINPUT_ALARM_HIGH_AI2 = 345,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI3
      AINPUT_ALARM_HIGH_AI3 = 346,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI4
      AINPUT_ALARM_HIGH_AI4 = 347,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI5
      AINPUT_ALARM_HIGH_AI5 = 348,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI6
      AINPUT_ALARM_HIGH_AI6 = 349,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI7
      AINPUT_ALARM_HIGH_AI7 = 350,
      //! Верхнее аварийное значение сигнала в пользовательском диапазоне, AI8
      AINPUT_ALARM_HIGH_AI8 = 351,

      //! Наклон характеристики измерительного входа, AI1
      AINPUT_SLOPE_AI1 = 352,
      //! Наклон характеристики измерительного входа, AI2
      AINPUT_SLOPE_AI2 = 353,
      //! Наклон характеристики измерительного входа, AI3
      AINPUT_SLOPE_AI3 = 354,
      //! Наклон характеристики измерительного входа, AI4
      AINPUT_SLOPE_AI4 = 355,
      //! Наклон характеристики измерительного входа, AI5
      AINPUT_SLOPE_AI5 = 356,
      //! Наклон характеристики измерительного входа, AI6
      AINPUT_SLOPE_AI6 = 357,
      //! Наклон характеристики измерительного входа, AI7
      AINPUT_SLOPE_AI7 = 358,
      //! Наклон характеристики измерительного входа, AI8
      AINPUT_SLOPE_AI8 = 359,

      //! Сдвиг характеристики измерительного входа, AI1
      AINPUT_SHIFT_AI1 = 360,
      //! Сдвиг характеристики измерительного входа, AI2
      AINPUT_SHIFT_AI2 = 361,
      //! Сдвиг характеристики измерительного входа, AI3
      AINPUT_SHIFT_AI3 = 362,
      //! Сдвиг характеристики измерительного входа, AI4
      AINPUT_SHIFT_AI4 = 363,
      //! Сдвиг характеристики измерительного входа, AI5
      AINPUT_SHIFT_AI5 = 364,
      //! Сдвиг характеристики измерительного входа, AI6
      AINPUT_SHIFT_AI6 = 365,
      //! Сдвиг характеристики измерительного входа, AI7
      AINPUT_SHIFT_AI7 = 366,
      //! Сдвиг характеристики измерительного входа, AI8
      AINPUT_SHIFT_AI8 = 367,

      //! Положение десятичной точки аналогового входа AI1
      AINPUT_DECIMAL_POINT_AI1 = 368,
      //! Положение десятичной точки аналогового входа AI2
      AINPUT_DECIMAL_POINT_AI2 = 369,
      //! Положение десятичной точки аналогового входа AI3
      AINPUT_DECIMAL_POINT_AI3 = 370,
      //! Положение десятичной точки аналогового входа AI4
      AINPUT_DECIMAL_POINT_AI4 = 371,
      //! Положение десятичной точки аналогового входа AI5
      AINPUT_DECIMAL_POINT_AI5 = 372,
      //! Положение десятичной точки аналогового входа AI6
      AINPUT_DECIMAL_POINT_AI6 = 373,
      //! Положение десятичной точки аналогового входа AI7
      AINPUT_DECIMAL_POINT_AI7 = 374,
      //! Положение десятичной точки аналогового входа AI8
      AINPUT_DECIMAL_POINT_AI8 = 375,

      //! Отключение режекторного фильтра, AI1
      AINPUT_NOTCH_FILTER_AI1 = 376,
      //! Отключение режекторного фильтра, AI2
      AINPUT_NOTCH_FILTER_AI2 = 377,
      //! Отключение режекторного фильтра, AI3
      AINPUT_NOTCH_FILTER_AI3 = 378,
      //! Отключение режекторного фильтра, AI4
      AINPUT_NOTCH_FILTER_AI4 = 379,
      //! Отключение режекторного фильтра, AI5
      AINPUT_NOTCH_FILTER_AI5 = 380,
      //! Отключение режекторного фильтра, AI6
      AINPUT_NOTCH_FILTER_AI6 = 381,
      //! Отключение режекторного фильтра, AI7
      AINPUT_NOTCH_FILTER_AI7 = 382,
      //! Отключение режекторного фильтра, AI8
      AINPUT_NOTCH_FILTER_AI8 = 383,

      //! Компенсация температуры холодного спая, AI1
      AINPUT_JUNCTION_AI1 = 384,
      //! Компенсация температуры холодного спая, AI2
      AINPUT_JUNCTION_AI2 = 385,
      //! Компенсация температуры холодного спая, AI3
      AINPUT_JUNCTION_AI3 = 386,
      //! Компенсация температуры холодного спая, AI4
      AINPUT_JUNCTION_AI4 = 387,
      //! Компенсация температуры холодного спая, AI5
      AINPUT_JUNCTION_AI5 = 388,
      //! Компенсация температуры холодного спая, AI6
      AINPUT_JUNCTION_AI6 = 389,

      // НАСТРОЙКИ АНАЛОГОВЫХ ВЫХОДОВ

      AOUTPUT_TYPE_AO1 = 416, //!< Тип выходного сигнала, выход 1
      AOUTPUT_TYPE_AO2 = 417, //!< Тип выходного сигнала, выход 2
      AOUTPUT_TYPE_AO3 = 418, //!< Тип выходного сигнала, выход 3
      AOUTPUT_TYPE_AO4 = 419, //!< Тип выходного сигнала, выход 4

      //! Нижний предел нормализации аналогового выхода AO1
      AOUTPUT_NORMALIZE_LOW_AO1 = 420,
      //! Нижний предел нормализации аналогового выхода AO2
      AOUTPUT_NORMALIZE_LOW_AO2 = 421,
      //! Нижний предел нормализации аналогового выхода AO3
      AOUTPUT_NORMALIZE_LOW_AO3 = 422,
      //! Нижний предел нормализации аналогового выхода AO4
      AOUTPUT_NORMALIZE_LOW_AO4 = 423,

      //! Верхний предел нормализации аналогового выхода AO1
      AOUTPUT_NORMALIZE_HIGH_AO1 = 424,
      //! Верхний предел нормализации аналогового выхода AO2
      AOUTPUT_NORMALIZE_HIGH_AO2 = 425,
      //! Верхний предел нормализации аналогового выхода AO3
      AOUTPUT_NORMALIZE_HIGH_AO3 = 426,
      //! Верхний предел нормализации аналогового выхода AO4
      AOUTPUT_NORMALIZE_HIGH_AO4 = 427,

      //! Безопасное значение аналогового выхода AO1
      AOUTPUT_SAFE_VALUE_AO1 = 428,
      //! Безопасное значение аналогового выхода AO2
      AOUTPUT_SAFE_VALUE_AO2 = 429,
      //! Безопасное значение аналогового выхода AO3
      AOUTPUT_SAFE_VALUE_AO3 = 430,
      //! Безопасное значение аналогового выхода AO4
      AOUTPUT_SAFE_VALUE_AO4 = 431,

      //! Задержка перехода выходов в безопасное состояние, x * с
      AOUTPUT_SAFE_STATE_DELAY = 432,

      // НАСТРОЙКА ИНТЕРФЕЙСА СВЯЗИ И СОХРАНЕНИЕ ПАРАМЕТРОВ
      // В ЭНЕРГОНЕЗАВИСИМУЮ ПАМЯТЬ

      MODBUS_ADDRESS       = 448, //!< Modbus-адрес устройства
      MODBUS_BAUDRATE      = 449, //!< Скорость обмена по интерфейсу
      MODBUS_PARITY        = 450, //!< Контроль четности
      MODBUS_STOP_BITS     = 451, //!< Стоп-биты
      MODBUS_DELAY         = 452, //!< Задержка ответа по интерфейсу, x * мс
      MODBUS_SAVE_SETTINGS = 453, //!< Применение и сохранение настроек Modbus

      //! Внутренняя ошибка модуля
      INTERNAL_ERROR = 454, 
      //! Сохранение всех настроек во Flash-память
      SAVE_SETTINGS  = 455,
      //! Сброс настроек на заводские параметры
      FACTORY_RESET  = 456,

      SIZE //!< Кол-во регистров в модуле
    };
  };
}